cl234583745/ra8/10_ra8t2_ecat_foe_dual-bank swap/prj/RA8T2_MCK_esc_ETG5003_CPU0/src/r_fw_up_ra/r_fw_up_buf.c
/***********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
 * SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2020 Renesas Electronics Corporation. All rights reserved.
 ***********************************************************************************************************************/
/***********************************************************************************************************************
 * File Name    : r_fw_up_buf.c
 * Version      : 1.00
 * Description  : Firmware update buffer process file
 ***********************************************************************************************************************/
/***********************************************************************************************************************
 * History : DD.MM.YYYY Version  Description
 *         : 15.05.2020 1.00     First Release
 ***********************************************************************************************************************/
/***********************************************************************************************************************
 Includes <System Includes> , "Project Includes"
 ***********************************************************************************************************************/
#include <stdint.h>
#include <string.h>
#include <stdlib.h>
#include <stdbool.h>
#include "r_fw_up_ra_if.h"
#include "r_fw_up_buf.h"
#include "r_fw_up_ra_private.h"

/***********************************************************************************************************************
 Private variables and functions
 ***********************************************************************************************************************/
static fw_up_mot_s_buf_t *papp_put_mot_s_buf = NULL;
static fw_up_mot_s_buf_t *papp_get_mot_s_buf = NULL;
static fw_up_mot_s_buf_t mot_s_buf[FW_UP_BUF_NUM];

static fw_up_write_data_t *papp_write_buf = NULL;
static fw_up_write_data_t write_buf[FW_UP_BINARY_BUF_NUM];

static fw_up_mot_s_cnt_t mot_s_data_state = STATE_MOT_S_RECORD_MARK;

static uint32_t write_current_address;

static bool detect_terminal_flag = false;

static bool fw_up_ascii_to_hexbyte(uint8_t in_upper, uint8_t in_lower, uint8_t *p_hex_buf);

/***********************************************************************************************************************
 * Function Name: fw_up_buf_init
 * Description  : Initialize buffer.
 * Arguments    : none
 * Return Value : none
 ***********************************************************************************************************************/
void fw_up_buf_init(void)
{
    fw_up_mot_s_buf_t *pmot_s_buf;
    fw_up_write_data_t *pwrite_buf;
    uint32_t i;

    for (i = 0; i < FW_UP_BINARY_BUF_NUM; i++)
    {
        pwrite_buf = (fw_up_write_data_t *) &write_buf[i];

        /* Clear write address */
        pwrite_buf->addr = 0x00000000;

        /* Clear data length in buffer */
        pwrite_buf->len = 0;

        /* Clear data buffer */
        (void)memset((pwrite_buf->data), (0xFF), (FW_UP_BINARY_BUF_SIZE));

        /* Set next buffer address */
        pwrite_buf->pnext = (fw_up_write_data_t *)&write_buf[i + 1u];

        /* Set previous buffer address */
        pwrite_buf->pprev = (fw_up_write_data_t *)&write_buf[i - 1u];
    }

    /* Set next buffer address of last buffer is first buffer */
    pwrite_buf->pnext = (fw_up_write_data_t *)&write_buf[0];

    /* Set previous buffer address of first buffer is last buffer */
    write_buf[0].pprev = pwrite_buf;

    /* Set currently buffer in use is first buffer */
    papp_write_buf = (fw_up_write_data_t *)&write_buf[0];

    /* Set currently write address is initial address of option setting memory */
    write_current_address = 0u;

    /* Set write address of currently buffer in use is "write_current_address" */
    papp_write_buf->addr = write_current_address;

    for (i = 0; i < FW_UP_BUF_NUM; i++)
    {
        pmot_s_buf = (fw_up_mot_s_buf_t *)&mot_s_buf[i];

        /* Clear record type */
        pmot_s_buf->type = 0;

        /* Clear data length */
        pmot_s_buf->data_length = 0;

        /* Clear address length */
        pmot_s_buf->addr_length = 0;

        /* Clear initial address of allocated memory for address */
        if (NULL != pmot_s_buf->paddress)
        {
            free(pmot_s_buf->paddress);
            pmot_s_buf->paddress = NULL;
        }

        /* Clear initial address of allocated memory for data */
        if (NULL != pmot_s_buf->pdata)
        {
            free(pmot_s_buf->pdata);
            pmot_s_buf->pdata = NULL;
        }

        /* Clear lock flag */
        pmot_s_buf->act = BUF_UNLOCK;

        pmot_s_buf->pnext = (fw_up_mot_s_buf_t *)&mot_s_buf[i + 1u];
    }

    /* Set next buffer address of last buffer is first buffer */
    pmot_s_buf->pnext = (fw_up_mot_s_buf_t *)&mot_s_buf[0];

    /* Set currently buffer in use is first buffer */
    papp_put_mot_s_buf = (fw_up_mot_s_buf_t *)&mot_s_buf[0];
    papp_get_mot_s_buf = (fw_up_mot_s_buf_t *)&mot_s_buf[0];

    /* Clear analysis state of Motorola s record format */
    mot_s_data_state = STATE_MOT_S_RECORD_MARK;

