cl234583745/ra8/10_ra8t2_ecat_foe_dual-bank swap/prj/RA8T2_MCK_esc_ETG5003_CPU0/src/r_fw_up_ra/r_fw_up_buf.c
    /* Clear detect terminal record flag */
    detect_terminal_flag = false;

} /* End of function fw_up_buf_init() */

/***********************************************************************************************************************
 * Function Name: fw_up_memory_init
 * Description  : Initialize variable for store address of allocated memory.
 * Arguments    : none
 * Return Value : none
 ***********************************************************************************************************************/
void fw_up_memory_init(void)
{
    fw_up_mot_s_buf_t *pmot_s_buf;
    uint32_t i;

    for (i = 0; i < FW_UP_BUF_NUM; i++)
    {
        pmot_s_buf = (fw_up_mot_s_buf_t *) &mot_s_buf[i];

        /* Clear initial address of allocated memory for address */
        pmot_s_buf->paddress = NULL;

        /* Clear initial address of allocated memory for data */
        pmot_s_buf->pdata = NULL;

        pmot_s_buf->pnext = (fw_up_mot_s_buf_t *) &mot_s_buf[i + 1u];
    }

} /* End of function fw_up_memory_init() */

/***********************************************************************************************************************
 * Function Name: fw_up_put_mot_s
 * Description  : Put in ring buffer and analysis Motorola s record format data.
 * Arguments    : mot_s_data -
 *                  Motorola s record format data
 * Return Value : FW_UP_SUCCESS -
 *                  Processing completed successfully.
 *                FW_UP_ERR_BUF_FULL -
 *                  Ring buffer is not empty.
 *                FW_UP_ERR_INVALID_RECORD -
 *                  Motorola S record format data is invalid.
 *                FW_UP_ERR_INTERNAL -
 *                  Memory allocation is failed.
 ***********************************************************************************************************************/
fw_up_return_t fw_up_put_mot_s(uint8_t mot_s_data)
{
    fw_up_return_t ret = FW_UP_SUCCESS;

    static uint32_t cnt;
    static uint32_t sum_value;
    static uint8_t mot_buf;
    static uint8_t *pwork_addr;
    uint8_t len_buf;
    uint8_t chk_sum;
    bool chk_ascii;

    if (BUF_LOCK == papp_put_mot_s_buf->act)
    {
        return FW_UP_ERR_BUF_FULL;
    }

    if (true == detect_terminal_flag)
    {
        return FW_UP_SUCCESS;
    }

    switch (mot_s_data_state)
    {
        case STATE_MOT_S_RECORD_MARK:

            /* Header field (upper 4bits) */
            /* Casting is valid because the width is a constant expressible with 8 bits. */
            if ((uint8_t)'S' == mot_s_data)
            {
                /* Update analysis state */
                mot_s_data_state = STATE_MOT_S_RECORD_TYPE;
            }
            /* Casting is valid because the width is a constant expressible with 8 bits. */
            else if (((uint8_t)'\n' == mot_s_data) || ((uint8_t)'\r' == mot_s_data))
            {
                /* Do nothing, ignore CR+LF */
            }
            else
            {
                ret = FW_UP_ERR_INVALID_RECORD;
            }
        break;

        case STATE_MOT_S_RECORD_TYPE:

            /* Header field (lower 4bits) */
            /* Convert to hex byte from ASCII data */
            /* Casting is valid because the width is a constant expressible with 8 bits. */
            chk_ascii = fw_up_ascii_to_hexbyte((uint8_t)'0', mot_s_data, &(papp_put_mot_s_buf->type));
            if (false == chk_ascii)
            {
                return FW_UP_ERR_INVALID_RECORD;
            }

            /* Update analysis state */
            mot_s_data_state = STATE_MOT_S_LENGTH_1;
        break;

        case STATE_MOT_S_LENGTH_1:

            /* Length field (upper 4bits) */
            /* Put in buffer */
            mot_buf = mot_s_data;

            /* Clear check sum compare value */
            sum_value = 0;

            /* Update analysis state */
            mot_s_data_state = STATE_MOT_S_LENGTH_2;
        break;

        case STATE_MOT_S_LENGTH_2:

            /* Length field (lower 4bits) */
            chk_ascii = fw_up_ascii_to_hexbyte(mot_buf, mot_s_data, &len_buf);
            if (false == chk_ascii)
            {
                return FW_UP_ERR_INVALID_RECORD;
            }

            /* Check address length */
            /* Casting is valid because the width is a constant expressible with 8 bits. */
            if ((((uint8_t)0 == papp_put_mot_s_buf->type) || ((uint8_t)1 == papp_put_mot_s_buf->type))
                    || ((uint8_t)9 == papp_put_mot_s_buf->type))
            {
                papp_put_mot_s_buf->addr_length = (ADDRESS_LENGTH_S1 / 2);
            }
            /* Casting is valid because the width is a constant expressible with 8 bits. */
            else if (((uint8_t)2 == papp_put_mot_s_buf->type) || ((uint8_t)8 == papp_put_mot_s_buf->type))
            {
                papp_put_mot_s_buf->addr_length = (ADDRESS_LENGTH_S2 / 2);
            }
            /* Casting is valid because the width is a constant expressible with 8 bits. */
            else if (((uint8_t)3 == papp_put_mot_s_buf->type) || ((uint8_t)7 == papp_put_mot_s_buf->type))
            {
                papp_put_mot_s_buf->addr_length = (ADDRESS_LENGTH_S3 / 2);
            }
            else
            {
                return FW_UP_ERR_INVALID_RECORD;
            }

            /* Allocate memory of the address data */
            /* Casting is valid because conversion of void pointer to concrete type pointer. */
            papp_put_mot_s_buf->paddress = (uint8_t *)malloc(papp_put_mot_s_buf->addr_length);
            if (NULL == papp_put_mot_s_buf->paddress)
            {
                return FW_UP_ERR_INTERNAL;
            }

            /* Calculate data length */
            /* Casting is valid because the width is a constant expressible with 8 bits. */
            papp_put_mot_s_buf->data_length =(uint8_t) (len_buf
                    - (papp_put_mot_s_buf->addr_length + (uint8_t)(MOT_S_CHECK_SUM_FIELD / 2)));

            /* Allocate memory of the data */
            if ((uint8_t)0 != papp_put_mot_s_buf->data_length)
            {
                /* Casting is valid because conversion of void pointer to concrete type pointer. */
                papp_put_mot_s_buf->pdata = (uint8_t *)malloc(papp_put_mot_s_buf->data_length);
                if (NULL == papp_put_mot_s_buf->pdata)
                {
                    return FW_UP_ERR_INTERNAL;
                }
            }

            /* Copy initial address of address data */
            pwork_addr = papp_put_mot_s_buf->paddress;

