cl234583745/ra8/10_ra8t2_ecat_foe_dual-bank swap/prj/RA8T2_MCK_esc_ETG5003_CPU0/src/r_fw_up_ra/r_fw_up_buf.c
            /* Add length value to check sum value */
            sum_value += len_buf;

            /* Clear 2bytes convert counter */
            cnt = 0;

            /* Update analysis state */
            mot_s_data_state = STATE_MOT_S_ADDRESS;
        break;

        case STATE_MOT_S_ADDRESS:

            /* Length field */
            if (1u == (cnt % 2u))
            {
                chk_ascii = fw_up_ascii_to_hexbyte(mot_buf, mot_s_data, pwork_addr);
                if (false == chk_ascii)
                {
                    return FW_UP_ERR_INVALID_RECORD;
                }

                /* Add address data to check sum value */
                sum_value += (*pwork_addr);

                /* Increment address */
                pwork_addr++;
            }

            /* Increment 2bytes convert counter */
            cnt++;

            /* put in buffer */
            mot_buf = mot_s_data;

            /* Casting is valid because conversion to wide type. */
            if (((uint32_t)papp_put_mot_s_buf->addr_length * 2u) <= cnt)
            {
                /* Clear 2bytes convert counter */
                cnt = 0;

                /* Copy initial address of data */
                pwork_addr = papp_put_mot_s_buf->pdata;

                /* Update analysis state */
                if ((uint8_t)0 != papp_put_mot_s_buf->data_length)
                {
                    mot_s_data_state = STATE_MOT_S_DATA;
                }
                else
                {
                    mot_s_data_state = STATE_MOT_S_CHKSUM_1;
                }
            }
        break;

        case STATE_MOT_S_DATA:

            /* Data field */
            if (1u == (cnt % 2u))
            {
                chk_ascii = fw_up_ascii_to_hexbyte(mot_buf, mot_s_data, pwork_addr);
                if (false == chk_ascii)
                {
                    return FW_UP_ERR_INVALID_RECORD;
                }

                /* Add data to check sum value */
                sum_value += (*pwork_addr);

                /* Increment address */
                pwork_addr++;
            }

            /* Increment 2bytes convert counter */
            cnt++;

            /* Put in buffer */
            mot_buf = mot_s_data;

            /* Casting is valid because conversion to wide type. */
            if (((uint32_t)papp_put_mot_s_buf->data_length * 2u) <= cnt)
            {
                /* Clear 2bytes convert counter */
                cnt = 0;

                /* Update analysis state */
                mot_s_data_state = STATE_MOT_S_CHKSUM_1;
            }
        break;

        case STATE_MOT_S_CHKSUM_1:

            /* Check sum field (upper 4bits) */
            /* Put in buffer */
            mot_buf = mot_s_data;

            /* Update analysis state */
            mot_s_data_state = STATE_MOT_S_CHKSUM_2;
        break;

        case STATE_MOT_S_CHKSUM_2:
            chk_ascii = fw_up_ascii_to_hexbyte(mot_buf, mot_s_data, &chk_sum);
            if (false == chk_ascii)
            {
                return FW_UP_ERR_INVALID_RECORD;
            }

            /* Compare check sum value */
            /* Casting is valid because higher 24 bits is not used. */
            if ((uint8_t)((~sum_value) & 0x000000FFu) != chk_sum)
            {
                return FW_UP_ERR_INVALID_RECORD;
            }

            /* Lock currently buffer in use */
            papp_put_mot_s_buf->act = BUF_LOCK;

            /* Check address length */
            /* Casting is valid because the width is a constant expressible with 8 bits. */
            if ((((uint8_t)7 == papp_put_mot_s_buf->type) || ((uint8_t)8 == papp_put_mot_s_buf->type))
                    || ((uint8_t)9 == papp_put_mot_s_buf->type))
            {
                /* Decect terminal record */
                detect_terminal_flag = true;
            }

            /* Set currently buffer in use is next buffer */
            papp_put_mot_s_buf = papp_put_mot_s_buf->pnext;

            /* Clear analysis state */
            mot_s_data_state = STATE_MOT_S_RECORD_MARK;
        break;

        default:
            ;
        break;
    }

    return ret;

} /* End of function fw_up_put_mot_s() */

/***********************************************************************************************************************
 * Function Name: fw_up_get_binary
 * Description  : Put in ring buffer and analysis Motorola s record format data.
 * Arguments    : *p_fl_data -
 *                  Pointer to initial address, write address, data size
 * Return Value : FW_UP_SUCCESS -
 *                    Processing completed successfully.
 *                FW_UP_ERR_BUF_EMPTY -
 *                    Ring buffer is empty.
 ***********************************************************************************************************************/
fw_up_return_t fw_up_get_binary(fw_up_fl_data_t *p_fl_data)
{
    fw_up_return_t ret = FW_UP_SUCCESS;

    fw_up_write_data_t *pprev_write_buf;
    fw_up_write_data_t *plocal_write_buf;

    uint32_t addr_buf = 0;
    uint32_t put_number;
    uint32_t i;
    uint8_t *pwork_addr;

    pwork_addr = NULL;

    pprev_write_buf = papp_write_buf->pprev;

    pprev_write_buf->len = 0;
    (void)memset((pprev_write_buf->data), (0xFF), (FW_UP_BINARY_BUF_SIZE));

    while (FW_UP_BINARY_BUF_SIZE > papp_write_buf->len)
    {
        if (BUF_UNLOCK == papp_get_mot_s_buf->act)
        {
            if (true == detect_terminal_flag)
            {
                if (0u != papp_write_buf->len)
                {
                    papp_write_buf->len = FW_UP_BINARY_BUF_SIZE;
                    break;
                }
                else
                {
                    return FW_UP_ERR_BUF_EMPTY;
                }
            }
            else
            {
                return FW_UP_ERR_BUF_EMPTY;
            }
        }

        /* Check data record */
        /* Casting is valid because the width is a constant expressible with 8 bits. */
        if ((((uint8_t)1 == papp_get_mot_s_buf->type) || ((uint8_t)2 == papp_get_mot_s_buf->type)) || ((uint8_t)3 == papp_get_mot_s_buf->type))
        {

            pwork_addr = papp_get_mot_s_buf->paddress;

