cl234583745/ra8/10_ra8t2_ecat_foe_dual-bank swap/prj/RA8T2_MCK_esc_ETG5003_CPU0/src/r_fw_up_ra/r_fw_up_buf.c
            addr_buf = 0;
            for (i = 0; i < papp_get_mot_s_buf->addr_length; i++)
            {
                addr_buf = (addr_buf << 8u);
                addr_buf |= (*pwork_addr);

                /* Increment address */
                pwork_addr++;
            }

            if (0u == papp_write_buf->len)
            {
                /* Calculate currently write address */
                write_current_address = (addr_buf / FW_UP_BINARY_BUF_SIZE) * FW_UP_BINARY_BUF_SIZE;

                /* Set currently write address to write address in buffer */
                papp_write_buf->addr = write_current_address;

                /* Set difference of less than write size to data length */
                papp_write_buf->len = addr_buf % FW_UP_BINARY_BUF_SIZE;
            }
            else
            {
                /* Set difference between currently write address and write address in buffer to data length */
                papp_write_buf->len = addr_buf - papp_write_buf->addr;
            }

            if (FW_UP_BINARY_BUF_SIZE <= papp_write_buf->len)
            {
                papp_write_buf->len = FW_UP_BINARY_BUF_SIZE;
                break;
            }

            put_number = FW_UP_BINARY_BUF_SIZE - papp_write_buf->len;

            if (put_number >= papp_get_mot_s_buf->data_length)
            {
                pwork_addr = papp_get_mot_s_buf->pdata;

                for (i = 0; i < papp_get_mot_s_buf->data_length; i++)
                {
                    papp_write_buf->data[i + papp_write_buf->len] = *pwork_addr;
                    pwork_addr++;
                }

                papp_write_buf->len += papp_get_mot_s_buf->data_length;
            }
            else
            {
                pwork_addr = papp_get_mot_s_buf->pdata;

                for (i = 0; i < put_number; i++)
                {
                    papp_write_buf->data[i + papp_write_buf->len] = *pwork_addr;
                    pwork_addr++;
                }

                papp_write_buf->len += put_number;

                plocal_write_buf = papp_write_buf->pnext;

                for (i = 0; i < (papp_get_mot_s_buf->data_length - put_number); i++)
                {
                    plocal_write_buf->data[i] = *pwork_addr;
                    pwork_addr++;
                }

                plocal_write_buf->len = i;
            }
        }

        /* Release address and data memory */
        free(papp_get_mot_s_buf->paddress);
        free(papp_get_mot_s_buf->pdata);

        /* Set NULL */
        papp_get_mot_s_buf->paddress = NULL;
        papp_get_mot_s_buf->pdata = NULL;

        /* Release buffer */
        papp_get_mot_s_buf->act = BUF_UNLOCK;

        /* Set currently buffer in use is next buffer */
        papp_get_mot_s_buf = papp_get_mot_s_buf->pnext;
    }

    /* Set data address, write address, data length to argument */
    /* Casting is valid because the width of address value is 32bits. */
    p_fl_data->src_addr = (uint32_t) papp_write_buf->data;
    p_fl_data->dst_addr = papp_write_buf->addr;
    p_fl_data->len = papp_write_buf->len;

    /* Set currently write buffer in use is next buffer */
    papp_write_buf = papp_write_buf->pnext;

    /* Increase currently write address */
    write_current_address += FW_UP_BINARY_BUF_SIZE;

    /* Set currently write address to write buffer */
    papp_write_buf->addr = write_current_address;

    return ret;

} /* End of function fw_up_get_binary() */

/***********************************************************************************************************************
 * Function Name: fw_up_ascii_to_hexbyte
 * Description  : Convert 2 bytes of ASCII data to 1 byte of hexadecimal.
 * Arguments    : in_upper -
 *                  upper data for ASCII.
 *                in_lower -
 *                  lower data for ASCII.
 *                *p_hex_buf -
 *                  Pointer to store converted 1 byte of hexadecimal
 * Return Value : true -
 *                  Processing completed successfully.
 *                false -
 *                  ASCII data is invalid.
 ***********************************************************************************************************************/
static bool fw_up_ascii_to_hexbyte(uint8_t in_upper, uint8_t in_lower, uint8_t *p_hex_buf)
{
    bool ret = true;

    /* Convert upper 4 bits */
    /* Casting is valid because the width is a constant expressible with 8 bits. */
    if (((uint8_t)0x30 <= in_upper) && ((uint8_t)0x39 >= in_upper))
    {
        /* Casting is valid because the width is a constant expressible with 8 bits. */
        in_upper = (in_upper & (uint8_t)0x0F);
    }
    /* Casting is valid because the width is a constant expressible with 8 bits. */
    else if (((uint8_t)0x41 <= in_upper) && ((uint8_t)0x46 >= in_upper))
    {
        /* Casting is valid because the width is a constant expressible with 8 bits. */
        in_upper = (uint8_t)(in_upper - (uint8_t)0x37);
    }
    /* Casting is valid because the width is a constant expressible with 8 bits. */
    else if (((uint8_t)0x61 <= in_upper) && ((uint8_t)0x66 >= in_upper))
    {
        /* Casting is valid because the width is a constant expressible with 8 bits. */
        in_upper = (uint8_t)(in_upper - (uint8_t)0x57);
    }
    else
    {
        ret = false;
    }

    /* Convert lower 4 bits */
    /* Casting is valid because the width is a constant expressible with 8 bits. */
    if (((uint8_t)0x30 <= in_lower) && ((uint8_t)0x39 >= in_lower))
    {
        /* Casting is valid because the width is a constant expressible with 8 bits. */
        in_lower = (uint8_t)(in_lower & (uint8_t)0x0F);
    }
    /* Casting is valid because the width is a constant expressible with 8 bits. */
    else if (((uint8_t)0x41 <= in_lower) && ((uint8_t)0x46 >= in_lower))
    {
        /* Casting is valid because the width is a constant expressible with 8 bits. */
        in_lower = (uint8_t)(in_lower - (uint8_t)0x37);
    }
    /* Casting is valid because the width is a constant expressible with 8 bits. */
    else if (((uint8_t)0x61 <= in_lower) && ((uint8_t)0x66 >= in_lower))
    {
        /* Casting is valid because the width is a constant expressible with 8 bits. */
        in_lower = (uint8_t)(in_lower - (uint8_t)0x57);
    }
    else
    {
        ret = false;
    }

    if (true == ret)
    {
        /* Combine upper and lower */
        *p_hex_buf = (uint8_t)(in_upper << 4) | in_lower;
    }

    return ret;
} /* End of function fw_up_ascii_to_hexbyte() */
